package org.uom.raavana.ananya.service.endpoints.gazetteer;

import java.util.*;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

import ananya.utils.gazetteer.Gazetteer;
import com.google.gson.Gson;

import com.google.gson.GsonBuilder;
import corpus.sinhala.SinhalaTokenizer;
import corpus.sinhala.SinhalaVowelLetterFixer;


public class AnnotationService {
	
	private String fixedText;
	private Gazetteer gazetteer;
	SinhalaVowelLetterFixer vowelFixer;
	private Map<String, TagEntry> entityObjectMap;
	private static final String PUNCTUATIONS = ",./-@#$ ";

	public AnnotationService(String gazetteerPath){

		gazetteer = Gazetteer.getInstance(gazetteerPath);
		entityObjectMap = new HashMap<>();
		vowelFixer = new SinhalaVowelLetterFixer();

	}

	private ArrayList<int[]> getCharacterOffsetArray(String checkText){
		int Stringlength = checkText.trim().length();

		ArrayList<int[]> offsetList = new ArrayList<int[]>();

		int [] offsetPair ;
		int count = 0;

		for (int i = -1; (i = fixedText.indexOf(checkText.trim(), i + 1)) != -1; ) {
			int start = i;
			int end = i+Stringlength;

			// check the previous letter
			if (start -1 > 0 && !PUNCTUATIONS.contains(fixedText.charAt(start-1)+"")){
				continue;
			}else if (end< fixedText.length() && !PUNCTUATIONS.contains(fixedText.charAt(end)+"")){
				continue;
			}else{
				offsetPair = new int[]{start,end};
				offsetList.add(offsetPair);
				count++;
			}

		}

	//	System.out.println(checkText+"------------->"+count);
		return offsetList;
	}

	private List<int[]> getOffSetArray(String checkText){
		int stringLength = checkText.length();
		List<int[]> offsetList = new ArrayList<>();

		Pattern pattern = Pattern.compile("\\b"+ checkText +"\\b");
		Matcher matcher = pattern.matcher(fixedText);

		int count = 0;
		while(matcher.find()){
			int start = matcher.start();
			int end = start + stringLength;

			offsetList.add(new int[]{start,end});
			count++;
		}

		System.out.println(checkText+"------------->"+count+"--------------------> "+pattern.toString());
		return offsetList;

	}


	private List<String> tokenizeText(){
		
		SinhalaTokenizer tokenizer = new SinhalaTokenizer();
	    return tokenizer.splitWords(fixedText);
	}

	/**
	 *
	 * @param originText
	 */
	private void cleanText(String originText){
		SinhalaVowelLetterFixer vowelFixer = new SinhalaVowelLetterFixer();
	    fixedText = vowelFixer.fixText(originText,false);
	}
	
	public String getFixedText(){
		return fixedText;
	}

	private void generateEntities() {

		List<String> tokenizedWords = tokenizeText();
		// get unique words from the list of tokenized words
		Set<String> uniqueWordsSet = new HashSet<>(tokenizedWords);
		List<int[]> offSetList;

		String currentToken;
		String[] arrayOfTexts;
		int entityCount = 0;
		int countOffSets = 0;

		Iterator<String> uniqStringIterator = uniqueWordsSet.iterator();
		while (uniqStringIterator.hasNext()) {
			currentToken = uniqStringIterator.next();
			//  get the offsets of texts occurrences
			offSetList = getCharacterOffsetArray(currentToken);
		//	characterOffsetArray = getOffSetArray(currentToken);
			countOffSets += offSetList.size();

			// tag for the text
			String tag = gazetteer.findNamedEntityTag(currentToken);

			if (tag != null){
				// text for tag
				arrayOfTexts = new String[]{currentToken};

				for (int[] offest : offSetList){
					List<int[]> offSetListForTag = new ArrayList<>();
					offSetListForTag.add(offest);
					TagEntry entity = new TagEntry(tag, arrayOfTexts,offSetListForTag);
					entityObjectMap.put("T" + Integer.toString(entityCount), entity);
					entityCount++;
				}
			}
		}

		System.out.println("Words : "+tokenizedWords.size());
		System.out.println("tags : "+entityCount);
		System.out.println("Offsets : "+countOffSets);
	}

	
	private String generateJSON(){
		
		Gson gson = new GsonBuilder().setPrettyPrinting().create();;
		String jsonOutput = gson.toJson(entityObjectMap);
		
		return jsonOutput;
				
	}


	public String tagNamedEntities(String text){

		// clean and set fixed texts
	//	cleanText(text);
		// generate the NE tags
		generateEntities();
		// convert to json and return
		return generateJSON();
	}

	public static void main(String args []){

		AnnotationService service = new AnnotationService("/home/farazath/Ananya/input/gazetteer");

		String response =
				service.tagNamedEntities("කුලරත්න ගන්කන්ද ගුණසේකර විශ්වවිද්\u200Dයාල ආචාර්යවරුන් තම ගැටලුවලට විසඳුම් ලබාදෙන ලෙස ඉල්ලා වෘත්තීය ක්\u200Dරියාමාර්ගවලට එළඹී මසක් ඉක්ම යන මේ මොහොත වන විටත් මෙරට පාලකයන් එම ඉල්ලීම්වලට නිසි ප්\u200Dරතිචාර නොදැක්වීම නිසා මෙරට ජාතික විශ්වවිද්\u200Dයාල පද්ධතියම අකර්මණ්\u200Dය වී ඇත. එවැනි පසුබිමක් තුළ ශ්\u200Dරී ජයවර්ධනපුර විශ්වවිද්\u200Dයාලයේ සිසුහු අනෙක් විශ්වවිද්\u200Dයාල ශිෂ්\u200Dයයන්ට සාපේක්ෂව ඉතා විශාල ශිෂ්\u200Dය මර්දනයකට මුහුණ පා සිටිති. විශේෂයෙන්ම පසුගිය කාලසීමාව තුළ ශ්\u200Dරී ජයවර්ධනපුර විශ්ව විද්\u200Dයාලයේ නිර්මාණය වූ මෙම අර්බුදය පිළිබඳව මාධ්\u200Dය හරහා රටම දැන්ගත්තේය. විවිධ චෝදනා එල්ල කරමින් සිසුන් හා භික්ෂූන් වහන්සේලා සියයකට ආසන්න පිරිසකගේ පන්ති පසුගිය කාල පරාසය තුළ තහනම් විය. 2010 වසරේ දෙසැම්බර් නව වන දින සිසුන් තිදෙනෙකුගේ හැර අන් සියලුදෙනාගේම පන්ති තහනම ඉවත් කිරීමට පාලක සභාව තීරණය කළේය. එහෙත් 2010 වසරේ පෙබරවාරි දහ තුන්වන දින විශ්වවිද්\u200Dයාලයේ ආරක්ෂක අංශ නිලධාරීන් සමග සිදුවූ ගැටුමක් හේතුවෙන් නැවත සිසුන් පහළොස් දෙනෙකුගේ පන්ති තහනම් කෙරිණි. මෙලෙස සිසුන් සැලකිය යුතු පමණක පන්ති තහනම් කර තිබුණද ඒ බොහෝ සිසුනට එරෙහිව තවමත් කිසිදු පරීක්ෂණයක් සිදුකර නැත. මෙම සිසුහු තර්ජනයට හා මර්දනයට ලක්වෙමින් සිටින අතර සිදුවන අභූත ක්\u200Dරියාකලාප හේතුවෙන් නිරන්තර ප්\u200Dරශ්නකිරීම්වලට භාජනයවෙමින් සිටිති. එමගින් ඔවුන්ගේ මානසික සෞඛ්\u200Dයයද තද බල ලෙස බිඳ වැටී ඇත. එසේම 2011 වසරේ ජුනි අටවන දින මානව ශාස්ත්\u200Dර හා සමාජ විද්\u200Dයා පීඨයේ ප්\u200Dරථම වසර සිසුවියන් විසි තුනක් ඇතුළු සිසුන් තිස් දෙදෙනෙකුගේ පමණ පන්ති තහනම් ව ඇත. එම පන්ති තහනමට හේතුවක් ලෙස දක්වා ඇත්තේ ඉන් සතියකට ඉහත, එනම් ජූනි මස පළවනදා පස්වරු පහත් හයත් අතර කාලයේ විශ්වවිද්\u200Dයාල ක්\u200Dරීඩා මණ්ඩපය හා ක්\u200Dරීඩා පිටිය තුළ නීති විරෝධී රැස්වීමක් සංවිධානය කිරීම හරහා රාජ්\u200Dය විරෝධී කුමන්ත්\u200Dරණ කරමින්, ඒ තුළ තමන් ද යෙදෙමින්, අහිංසක සිසුන් ඒ සඳහා බලෙන් යොදා ගනිමින් විශ්වවිද්\u200Dයාල සිසුන් ඝාතනය වන ආකාරයේ ක්\u200Dරියාවලියක් ක්\u200Dරියාත්මක කොට මළ සිසුවකුගේ හෝ සිසුන් කිහිපදෙනෙකුගේ මෘතදේහ රට පුරා ගෙන ගොස් රාජ්\u200Dය විරෝධී කැරැල්ලක් ඇති කිරීමට කුමණ්ත්\u200Dරණය කිරීම යන චෝදනාවයි. ප්\u200Dරථම වසර කණ්ඩායම් රැස්වීමක් සංවිධානය තුළින් ආචාර්ය අයිතීන් සුරකිමින්, ඉගෙනීමේ අයිතිය තහවුරු කරන ලෙස පාලකයන්ට බල කරන උද්ඝෝෂණය ගැන දැනුවත් කිරීමක් මිස ඉහත කිසිම ආකාරයක සිද්ධියක් මෙම රැස්වීම තුළ නොතිබුණු බව සිසුහු සඳහන් කරති. විශ්වවිද්\u200Dයාල තුළ රැස්වීම් පැවතීම සාමාන්\u200Dය සිද්ධියකි. උද්ඝෝෂණ පැවැත්වීම වුවද ජාත්\u200Dයන්තරයේ සිට බැලුවද සාමාන්\u200Dය තත්ත්වයකි. තම විශ්වවිද්\u200Dයාලය තුළ එම ප්\u200Dරජාතන්ත්\u200Dරවාදී අයිතියවත් නැතැයි ශ්\u200Dරී ජයවර්ධනපුර විශ්වවිද්\u200Dයාල සිසුහු චෝදනා නගති. 2010 වසරේ මාර්තු විසිහය වනදා ශාස්ත්\u200Dර පීඨ ශිෂ්\u200Dය සංගමයේ සභාපති මාවනානේ ඛේමින්ද හිමියන් වේදිකාවෙන් මහපොළවට කෙටි නාට්\u200Dය උළෙල මහා ශිෂ්\u200Dය සංගමය නමින් සංවිධානය කිරීමේ චෝදනාව මත පන්ති තහනමට ලක්විය. ඉන් දින හතරකට පසුව එම පන්ති තහනම කොළඹ සම්බන්ධව උපකුලපතිතුමා සමඟ සාකච්ඡා කිරීමට ගිය භික්ෂූන් වහන්සේලා අතරින් භික්ෂු සංගමයේ සභාපති හිමියන්ගේ පන්ති තහනම එදින සවස නිකුත් වන්නේ උපාධිධාරී ශිෂ්\u200Dය හිමි නමකට නුසුදුසු ආකාරයෙන් කටයුතු කිරීම යන චෝදනාව මතය. මහා ශිෂ්\u200Dය සංගමය නමින් පෝස්ටර් ඇලවීමේ වරදට තවත් සිසුන් සිව් දෙනෙකුගේ පන්ති මැයි මස දහඅට වනදා තහනම් විය. අත් පත්\u200Dරිකා බෙදාහැරීමකදී නීත්\u200Dයනුකූල නොවන ශිෂ්\u200Dය සංගමයක් මගින් ආචාර්යවරුන් නොමග යවන බවට පවසා තවත් සිසුන් හත් දෙනෙකුගේ පන්ති එදිනම තහනම් විය. ඉන් මසකට පමණ පසු අත්තනෝමතිකව සිදුවන පන්ති තහනම පිළිබඳව විරුද්ධත්වය පළ කරමින් පැවති සත්\u200Dයග්\u200Dරහයන්ට සිසුන් තුන්දහසක් පමණ සහභාගි වී ඇති නමුත් ඉන් විසි නවයකගේ පන්ති තහනම් වී ඇත්තේ රාජ්\u200Dය විරෝධී ප්\u200Dරකාශ සිදුකරමින් ආයතන ප්\u200Dරධානියාට බලපෑම් කිරීමේ චෝදනා මතය. එම වසරේ ජූලි මස පස්වෙනි දින උසස් අධ්\u200Dයාපන අමාත්\u200Dයවරයා පැමිණ සියලු පන්ති තහනම් කිරීම් ඉවත් කර, සිසුන් වෙනුවෙන් පනවා තිබූ සියලු නඩු එක්වර ඉවත් කර ඇත. නිවැරදිව නොහැසිරුණහොත් යළිත් එම පන්ති තහනම බලගැන්වීමට තමාට හැකියාවක් ඇති බව ද එහිදී ඔහු අදහස් දැක්වීය. සිසුන් තිදෙනෙකුගේ පන්ති තහනමකින් යළිත් මෙම ක්\u200Dරියාවලිය එම මස දහසය වනදා ඇරඹි‚. ඒ ශිෂ්\u200Dය භික්ෂූන් වහන්සේ කෙනකුගේ පියාගේ අභාවය පිළිබඳව දැන්වීමක් ඇලවීම සම්බන්ධවය. එස් බී දිසානායක මහතා ඉවත් කළ තහනම යළි උපකුලපතිවරයා විසින් බලගන්වන්නේ නවක සිසුන් පිළිගැනීමට ඉදි කළ තොරණක් මහනුවර ගිනි තැබූ සිද්ධියක් මතය. මේ අතර ශිෂ්\u200Dයාවන් පස්දෙනෙකු සඳහන් අතර, ඔවුන් ඒ මොහොත වන විට නේවාසිකාගාරය තුළ සිට ඇති බව චෝදනා ලැබුවෝ පවසති. එමෙන්ම තොරණ ඉදිකර තිබූ ස්ථානය විශ්වවිද්\u200Dයාලයේ ප්\u200Dරධාන පිවිසුම් දොරටුවට ආසන්න හෙයින් පැය විසිහතර පුරාම එම ස්ථානය අසළ ආරක්ෂක නිලධාරීහු සිටිති. එය සිදුවන අවස්ථාවේ එම නිලධාරීන් මැදිහත් නොවීම සැකසහිත වන අතර පනස් දෙදෙනාගෙන් දහඅට දෙනකුගේ පන්ති තහනම හදිසියේ එදින හවස යළි ඉවත් කොට ඇත. එහිදී පවසා ඇත්තේ එය අත්වැරැද්දකින් සිදු වූ බවයි. 2010 වසරේ ඔක්තෝබර් විසිහය වෙනිදා භික්ෂූන් වහන්සේ දෙනමකට භික්ෂු නේවාසිකාගාරය තුළදී උපකුලපතිවරයා පහර දී ඇති අතර එම භික්ෂූන් වහන්සේලා දහඅට නමක්ගේ පන්ති තහනම් කර තිබේ. 2010 දෙසැම්බර් දෙවෙනිදා නැවත උද්ඝෝෂණයක් හේතුවෙන් සිසුන් හතළිස් හතර දෙනෙකුගේ පන්ති තහනම් වූ අතර, ඒ අතර ඉන් මාස දෙකකට පමණ පෙර අපවත් වූ හිමිනමකගේ ද නම සඳහන් වී තිබීම පුදුමයට කරුණකි. 2011 වසරේ මෙවන් තත්ත්වයක් දරුණු ලෙසින් ඇතිවීම පටන් ගන්නේ හක්මන පදිංචි නුවන් ජනක සිසුවාගෙනි. ඒ විශ්වවිද්\u200Dයාල ආරක්ෂක අංශ නිලධාරීන් ලවා එම සිසුවාගේ නිවසට ගොස් ශිෂ්\u200Dයභාවය අහෝසි කරන බවට තර්ජනය කොට එම සිසුවා ලවාම වැඩිහිටි සිසුන් තමාට නවකවදය දුන් බවට හක්මන පොලීසියේ පැමි‚ල්ලක් කරවීම සහ එම සිසුවා බලහත්කාරයෙන් මාතර රෝහලට ඇතුළු කර සිසුන් පිරිසක් අත්අඩංගුවට ගැනීමට සැලසුම් කිරීමේ ක්\u200Dරියාවලියකින් බව අන්තර්විශ්ව විද්\u200Dයාල භික්ෂු බලමණ්ඩල කැඳවුම්කරු කඹුරුපිටියේ ඥානිස්සර හිමි පැවසීය. මෙලෙස සිදුවන අත්තනෝමතික පන්ති තහනම් හේතුවෙන් ඉගෙනීමේ කටයුතු කරගැනීමට හැකියාවක් නැතිවී ඇත්තේ නිදහස් අධ්\u200Dයාපනයේ පිටිවහලෙන් විශ්වවිද්\u200Dයාල සඳහා ඇතුළත් වූ සිසුන්ටය. වැරදි නොකරම දිගින් දිගටම එකම නම් ලැයිස්තුවක් ආශ්\u200Dරයෙන් පන්ති තහනම් ලිපි නිකුත් කිරීම සාධාරණ නැත. විශ්වවිද්\u200Dයාලවල උගන්වන්නේත්, ඉගෙන ගන්නේත් රටේ උගත්ම පිරිස බව සියලුදෙනා අවිවාදාත්මකව පිළිගනිති. මෙවන් ක්\u200Dරියා විශ්වවිද්\u200Dයාලයක් සම්බන්ධව කෙතරම් උචිතද යන්න තව වරක් සලකා බැලිය යුතුය. බැනරයක් ප්\u200Dරදර්ශනය කිරීමක්, පෝස්ටරයක් ඇලවීමක්, අත්පත්\u200Dරිකා බෙදීමක් මර්දනය කිරීම විශ්වවිද්\u200Dයාල පද්ධතිය තුළ ඇති ප්\u200Dරජාන්තන්ත්\u200Dරවාදී ලක්ෂණ බිඳ දැමීමකි. විශ්වවිද්\u200Dයාල සිසුන් රැස්වෙන සෑම මොහොතක්ම රාජ්\u200Dය විරෝධී කුමන්ත්\u200Dරණ බවට සැක කිරීමට පාලන අධිකාරියට ඇති සාධාරණ හේතුව කුමක්ද යන්න සැබවින්ම ගැටලුවකි. 1 අත්දැකීම් තුනක් කුරුප්පුගේ ඩිල්ෂාන් චමින්ද (කලා පීඨය, පළමු වසර) ගෙදර ඉඳන් එනකොට හොඳටම හවස් වුණා. ඇවිත් ටිකක් විවේක අරන්, දවස් ගණනාවකින් ආපු නිසා කැම්පස් එක පැත්තට ගියා. ස්විමිං පූල් එක ළඟ රුමේෂ් නෝට් එකක් බලනවා. අපි තුන් දෙනත් ඊට එකතුවුණා. අපි හිටියෙ සුදු යකඩ වැට ළඟ කතා කර කර උප කුලපති තුමා එද්දි. අපිත් එක්ක බොහොම සුහදව කතා කළා. ගල් පිට්ටනිය ප්\u200Dරතිසංස්කරණය කළේ කවුද කියලා ඇහුවා. අපි දන්නෙ නැහැ කිව්වා. උපකුලපතිතුමා තමන් එය කළ බව අපිට කිව්වා. අපි ඉගෙනුම ලබන්නෙ මොන වසරෙද කියලා ඇහුවා. අපි කිව්ව අපි පළවෙනි වසරෙ බව. උඹලා තමයි මම හම්බවෙන්න හිටියෙ කියලා පැවිලියන් එක එහා පැත්තට ගිහින් කමිස ගලවන්න කිව්වා. අපිත් එහෙම කළා. මගේ ඇරෙන්න අනෙක් තුන්දෙනාගෙම පිටේ තුවාල තිබ්බා. ඒවා සිද්ධ වුණේ සෙල්ලම් කරද්දි බවයි ඒ අය කිව්වෙ.. එක්කෙනෙක්ගෙ නම් තිබුණෙ ඉතාම පරණ කැළලක්.. කොහොම වුණත් උපකුලපතිතුමා කිව්ව අපිට තමුන්ගෙ කාරයට නගින්න කියලා. කාරයට යන ගමන් ආරක්ෂක අංශ නිලධාරියෙක් නංවාගෙන අපේ සියලු විස්තර ලියා ගත්තා. පොලීසියට වාහනය හරවන තුරු අපි දැනගෙන හිටියෙ නැහැ. අපිට ඇත්ත කියන්න කියලා උපකුලපතිවරයා කිව්වත්, අපිට එහෙම කියන්න යමක් තිබ්බෙ නැහැ. පොලීසියේ කොස්තාපල් වරුත් පැමි‚ල්ල ලියන්න අදිමදි කළා. උපකුලපතිවරයා ස්ථානාධිපතිට කතා කරලා අපිව භාර දීලා යන්න ගියා. මේජර්ලා දෙන්නෙක්, ආමි කෙනෙක්, සීඅයිඩී එකෙන් තවත් දෙන්නෙක් ඇවිත් අපෙන් ප්\u200Dරශ්න කළා ෆොටෝ ගත්තා.. වෛද්\u200Dයවරු අපිව චෙක් කළා. මට රිපෝට් දුන්නෙ නැහැ. අනික් දෙන්නව පහුවදාට එක්ක එන්න කිව්වා. මට ලක්ෂයක ශරීර ඇප දුන්නා. දින අනූවක් අනෙක් අයව රැඳවුම් භාරයෙ තියාගන්නවා කියලා සතියකින් එළියට දැම්මා. අපිව අත්අඩංගුවට ගත්ත හේතුව වගේම අපිට ඇප දුන්නෙ ඇයි කියන එකත් තවමත් අපිට විශාල ගැටලුවක්. මේ දේවල් නිසා අපි ඉන්නෙ පුදුම මානසික අසහනයක. අපේ දෙමව්පියොත් එහෙමයි..2 ඡේ.එම් නිශාන්ත සඳරුවන් (කලා පීඨය) හොස්ටල් එකේ නිදන් හිටියා. සිකුරුටියෙන් ඇවිත් කැම්පස් අයි ඩී එක ගත්තා. එයාලා පහළ කාමරයකට ගියා. ආයෙත් මගෙ අතට අයි ඩී එක ගෙනත් දුන්නා. දවස් හතරකට පහකට පස්සෙ අම්මා කතා කළා. පුතේ කැම්පස් එකෙන් ලියුමක් ඇවිත් කඩන්නද? කියලා. මගේ පන්ති තහනම තමයි ගෙදෙට්ට ගිහින් තියෙන්නෙ. ඉන් දින හතරකට පස්සෙ රාජ්\u200Dය ආරක්ෂක අමාත්\u200Dයංශෙන් කියලා අපේ ගෙදරට ගිහින් මම ගැන තොරතුරු අහලා. ඡේවීපී යට සම්බන්ධද? ගමේ ඉද්දි චර්යාව කොහොමද වගේ දේවල්. මගේ පන්ති තහනම තියෙන්නෙ මිනීපෙට්ටියක් උස්සගෙන ගියා කියලා. ඒක අසත්\u200Dයක්.. ගමටවත් මුහුණ දෙන්නෙ කොහොමද? ගමම හිතා ඉන්නෙ අපි ත්\u200Dරස්තවාදියො කියලා. 3 මට නඩු 3ක් තියෙනවා.. තාම වසරක් ගත වෙලත් විනය පරීක්ෂණ නැහැ. නිකරුණේ අපිට මෙහෙම කරන්නෙ ඇයි? අනික පන්ති තහනම නිසා අපිට නේවාසික සංඝාවාසෙට එන්න බැහැ. මහපොළ නැහැ. ඉගෙනුම් කටයුතුවලට ඉන්න බැහැ. විශ්වවිද්\u200Dයාල භූමිය විතරක් නෙවෙයි අපිට විඡේරාම හංදියෙන් මෙපිට තහනම් වෙලා.. උපකුලපතිවරයා දඬුවම් කරන්නෙ වෙයි කියලා හිතන වැරදි මනසින් ගොඩ නගාගෙන. එහි ඇති සාධාරණත්වය කුමක්ද කියලා තවමත් අපිට හිතා ගන්න බැහැ. අපිට නිදහසේ අධ්\u200Dයාපනය ලබන්න පුළුවන් වාතාවරණයක් නැහැ.\n");
	
	}
	
	
}
